arch/introduzione.org
#+TITLE: Introduzione ad Architettura degli elaboratori
#+AUTHOR: Jacopo Costantini

* Calcolatori elettronici
   Basati su tecnologie in rapidissima evoluzione
   Valvole → Transistor → IC = Integrated Circuit, VLSI = Very Large Scale Integration

** Legge di Moore
   Ogni 1,5 anni osserviamo il raddoppio di:
   1. Capacità di memoria
   2. Velocità del processore
   3. Abbattimento dei costi contemporaneamente all'incremento di velocità

** Trend
    Incremento prestazioni e abbattimento costi
    + Permette di affrontare e risolvere applicazioni sempre più complesse
    Integrazione con la rete
    + Sempre nuove applicazioni informatiche
    Integrazione con la rete telefonica e cellulare
    + Nuovi hw e applicazioni ( smartphone, IOT, ecc.)

* L'architettura di Von Neumann
  Le macchine moderne sono basate sulla macchina di Von Neumann

  - CPU ( parte operativa e parte di controllo )
  - Memoria ( per dati e programmi )
  - Periferiche di input e output

  Il BUS è il canale di cunicazione che consente ai dati di transitare fra diversi componenti dell'elaboratore

** Componenti principali di un computer
     + Input/Output ( I/O )
       - Mouse, tastiera ( I )
       - Video, stampante ( O )
       - Dischi ( I/O )
       - CD e DVD ( I/O o I )
       - Rete ( I/O )
	 
     + Memoria principale
       - DRAM ( Memoria dinamica ), SRAM ( Memoria Statica )
	 
     + Processore ( CPU )
       - Parte operativa ( Datapath )
       - Parte controllo ( control )
       - Bus

** Com'è fatto un computer
               - I/O
                - Serve per comunicare con l'esterno
                - Include dispositivi di memoria secondaria ( memoria non volatile ), acceduti come dispositivi di I/O
            - Memoria principale
                - Usata per memorizzare programmi e dati durante l'esecuzione ( concetti di stored-program introdotto da Von Neumann )
            - Processore
                - È l'esecutore delle istruzioni appartenenti ad un'ISA
                - ISA ( Instruction Set Architecture ) definisce quindi il linguaggio ( povero ) comprensibile dal processore
                - Le istruzioni sono lette dalla memoria, modificano dati in memoria o agiscono sull'I/O
                - Decomponibile in :
                    - Parte Controllo → Mente
                    - Parte Operativa → Braccio

* Il ruolo dell'astrazione
        - L'informatica si basa sul concetto di astrazione
        - L'astrazione è una tecnica di semplificazione
        - Il termine astrazione si riferisce alla distinzione tra le proprietà esterne di un'entità e i dettagli ella sua struttura interna
        - L'astrazione permette di ignorare i particolari interni di un congegno complesso e di usarlo come una singola unità
        
        Per progettare o capire l'architettura di un sistema, oppure per programmare semplicemente un sistema, abbiamo bisogno di astrarre.
        
        Se scendiamo di livello, troviamo fili e milioni di transistor, diventa così impossibile comprenderne il funzionamento
        
        - I livelli più alti virtualizzano, ovvero offrono una vista virtuale dei livelli inferiori
            - Macchina virtuale o astratta
                - Appare più potente e semplice da programmare della macchina sottostante
    
* Strutturazione in livelli
          Tradizionale vista a livelli dell'architettura hw/sw di un computer. Ogni livello mette a disposizione :
        
        - Uno o più linguaggi riconosciuti
        - Uno o più interpreti o compilatori per tradurre tra linguaggi
            
            <aside>
            🛠 Livello 4: Linguaggio ad alto livello
            Livello 3: Assembler
            Livello 2: Sistema Operativo
            Livello 1: Linguaggio Macchina ( ISA )
            Livello 0: Hardware/Firmware
            
            </aside>
