docs/arch/introduzione.html
<!doctype html>
<html lang="en">
<head>
<title>Introduzione ad Architettura degli elaboratori</title>
<!-- 2022-01-08 Sat 14:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Jacopo Costantini &amp; Matteo Zambon">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Calcolatori elettronici</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Legge di Moore</a></li>
<li><a href="#sec-1-2">1.2. Trend</a></li>
</ul>
</li>
<li><a href="#sec-2">2. L&rsquo;architettura di Von Neumann</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Componenti principali di un computer</a></li>
<li><a href="#sec-2-2">2.2. Com&rsquo;è fatto un computer</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Il ruolo dell&rsquo;astrazione</a></li>
<li><a href="#sec-4">4. Strutturazione in livelli</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. Sistema Operativo ( SO )</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Software applicativo e di sistema</a></li>
<li><a href="#sec-6">6. Storia</a>
<ul class="nav">
<li><a href="#sec-6-1">6.1. Abaco Cinese</a></li>
<li><a href="#sec-6-2">6.2. Macchina di Antikythera</a></li>
<li><a href="#sec-6-3">6.3. Pascalina 1640</a></li>
<li><a href="#sec-6-4">6.4. Leibnitz 1673</a></li>
<li><a href="#sec-6-5">6.5. Babbage 1824</a></li>
<li><a href="#sec-6-6">6.6. Hollerit 1890</a></li>
<li><a href="#sec-6-7">6.7. ENIAC 1946</a></li>
<li><a href="#sec-6-8">6.8. John Von Neumann</a></li>
<li><a href="#sec-6-9">6.9. Mauchly &amp; Eckert</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Introduzione ad Architettura degli elaboratori</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Calcolatori elettronici</h2>
<div class="outline-text-2" id="text-1">
<p>
Basati su tecnologie in rapidissima evoluzione
Valvole → Transistor → IC = Integrated Circuit, VLSI = Very Large Scale Integration
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Legge di Moore</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Ogni 1,5 anni osserviamo il raddoppio di:
</p>
<ol class="org-ol">
<li>Capacità di memoria
</li>
<li>Velocità del processore
</li>
<li>Abbattimento dei costi contemporaneamente all&rsquo;incremento di velocità
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Trend</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Incremento prestazioni e abbattimento costi
</p>
<ul class="org-ul">
<li>Permette di affrontare e risolvere applicazioni sempre più complesse
</li>
</ul>
<p>
Integrazione con la rete
</p>
<ul class="org-ul">
<li>Sempre nuove applicazioni informatiche
</li>
</ul>
<p>
Integrazione con la rete telefonica e cellulare
</p>
<ul class="org-ul">
<li>Nuovi hw e applicazioni ( smartphone, IOT, ecc.)
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> L&rsquo;architettura di Von Neumann</h2>
<div class="outline-text-2" id="text-2">
<p>
Le macchine moderne sono basate sulla macchina di Von Neumann
</p>

<ul class="org-ul">
<li>CPU ( parte operativa e parte di controllo )
</li>
<li>Memoria ( per dati e programmi )
</li>
<li>Periferiche di input e output
</li>
</ul>

<p>
Il BUS è il canale di cunicazione che consente ai dati di transitare fra diversi componenti dell&rsquo;elaboratore
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Componenti principali di un computer</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Input/Output ( I/O )
<ul class="org-ul">
<li>Mouse, tastiera ( I )
</li>
<li>Video, stampante ( O )
</li>
<li>Dischi ( I/O )
</li>
<li>CD e DVD ( I/O o I )
</li>
<li>Rete ( I/O )
</li>
</ul>
</li>

<li>Memoria principale
<ul class="org-ul">
<li>DRAM ( Memoria dinamica ), SRAM ( Memoria Statica )
</li>
</ul>
</li>

<li>Processore ( CPU )
<ul class="org-ul">
<li>Parte operativa ( Datapath )
</li>
<li>Parte controllo ( control )
</li>
<li>Bus
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Com&rsquo;è fatto un computer</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>I/O
<ul class="org-ul">
<li>Serve per comunicare con l&rsquo;esterno
</li>
<li>Include dispositivi di memoria secondaria ( memoria non volatile ), acceduti come dispositivi di I/O
</li>
</ul>
</li>
</ul>
<ul class="org-ul">
<li>Memoria principale
<ul class="org-ul">
<li>Usata per memorizzare programmi e dati durante l&rsquo;esecuzione ( concetti di stored-program introdotto da Von Neumann )
</li>
</ul>
</li>
<li>Processore
<ul class="org-ul">
<li>È l&rsquo;esecutore delle istruzioni appartenenti ad un&rsquo;ISA
</li>
<li>ISA ( Instruction Set Architecture ) definisce quindi il linguaggio ( povero ) comprensibile dal processore
</li>
<li>Le istruzioni sono lette dalla memoria, modificano dati in memoria o agiscono sull&rsquo;I/O
</li>
<li>Decomponibile in :
<ul class="org-ul">
<li>Parte Controllo → Mente
</li>
<li>Parte Operativa → Braccio
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Il ruolo dell&rsquo;astrazione</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>L&rsquo;informatica si basa sul concetto di astrazione
</li>
<li>L&rsquo;astrazione è una tecnica di semplificazione
</li>
<li>Il termine astrazione si riferisce alla distinzione tra le proprietà esterne di un&rsquo;entità e i dettagli ella sua struttura interna
</li>
<li>L&rsquo;astrazione permette di ignorare i particolari interni di un congegno complesso e di usarlo come una singola unità
</li>
</ul>

<p>
Per progettare o capire l&rsquo;architettura di un sistema, oppure per programmare semplicemente un sistema, abbiamo bisogno di astrarre.
</p>

<p>
Se scendiamo di livello, troviamo fili e milioni di transistor, diventa così impossibile comprenderne il funzionamento
</p>

<ul class="org-ul">
<li>I livelli più alti virtualizzano, ovvero offrono una vista virtuale dei livelli inferiori
<ul class="org-ul">
<li>Macchina virtuale o astratta
<ul class="org-ul">
<li>Appare più potente e semplice da programmare della macchina sottostante
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Strutturazione in livelli</h2>
<div class="outline-text-2" id="text-4">
<p>
Tradizionale vista a livelli dell&rsquo;architettura hw/sw di un computer. Ogni livello mette a disposizione :
</p>

<ul class="org-ul">
<li>Uno o più linguaggi riconosciuti
</li>
<li>Uno o più interpreti o compilatori per tradurre tra linguaggi

<p>
&lt;aside&gt;
🛠 Livello 4: Linguaggio ad alto livello
Livello 3: Assembler
Livello 2: Sistema Operativo
Livello 1: Linguaggio Macchina ( ISA )
Livello 0: Hardware/Firmware
</p>

<p>
&lt;/aside&gt;
</p>
</li>
</ul>
</div>
