arch/introduzione.org
** Sistema Operativo ( SO )
    - Per ora pensiamo al S.O come un livello il cui linguaggio è l'ISA estesa con nuove istruzioni ad alto livello per gestire risorse critiche
            - Offre nuove istruzioni oltre a quella base dell'ISA
        
        - Livello Hardware/Firmware
            - Livello della logica digitale ( HW )
                - Fili e porte logiche ( Gate ) realizzati tramite transistor ( speciali interruttori )
                - Gate ( fili ) elaborano ( trasportano ) segnali binari ( 0 / 1 )
                - Tramite questi segnali è possibile rappresentare qualsiasi tipo di informazione
                - Interconnettendo gate e fili è possibile realizzare funzioni complesse
                - È anche possibile realizzare elementi di memoria ( utilizzati per dati e programmi )
            - Livello della microarchitettura ( FW )
                - Costruito sopra il livello della logica digitale, si occupa di interpretare ed eseguire le istruzioni del livello ISA
                - È il livello di macchina nuda che appare al programmatore di sistema
                - comprende un insieme di istruzioni che di solito sono diverse per ogni processore
                    - Problema della portabilità binaria
                - La sintassi è adatta ad essere interpretata facilmente dal livello sottostante
        - Livello Linguaggio Macchina ( ISA )
            
            Le istruzioni sono stringhe di Bit con formato ben determinato per permettere la facile individuazione di codice e operandi delle istruzioni 
            
            - I codici individuano l'operazione elementare che l’istruzione dovrà eseguire
            - Gli operandi si riferiscono alle locazioni di memoria che contengono i dati su cui eseguire l'operazione e le locazioni dove memorizzare i risultati
        - Livello Linguaggio Assembler
            - Offre al programmatore di sistema una vista più "umana" del livello macchina
                - Istruzioni espresse con stringhe di carattere mnemoniche invece di stringhe binarie
                - Traduzione realizzata dall’assemblatore ( è una speciale compilatore ) rispetto al livello macchina
            - L'assemblatore è uno dei primi software di sistema realizzato per facilitare la programmazione dei calcolatori
        - Livello Linguaggio ad alto livello
            - C, C++, Modula 3, Java, ...
            - Permette al programmatore una maggiore astrazione rispetto ai livelli sottostanti della macchina
            - Ha di solito bisogno di un traduttore ( compilatore )
            - Per alcuni linguaggi esistono interpreti: per esempio Java
            - È il livello solitamente usato per produrre software
            - Tale livello permette di realizzare la portabilità tra processori con diversa ISA
                - Basta che esista il compilatore/interprete implementato per la nuova ISA
* Software applicativo e di sistema
Compilatori, assemblatori, OS, Word processor, ecc... è tutto software
        - Il software di sistema serve a
            - Produrre altro software ( sia di sistema che applicativo )
            - Permettere l'esecuzione di altro software
        - Il software applicativo
            - Costruisce la maggior parte del software
            - Lo scopo di questo software dipende dallo specifico campo applicativo
                - Applicazioni bancarie
                - CAD
                - Word processor
                - Foglio elettronico
* Storia
** Abaco Cinese
            - L'abaco cinese può essere considerato il primo modello matematico di calcolo
            - In questo modello si possono formalizzare le quattro operazioni
                - Somma
                - Sottrazione
                - Prodotto
                - Divisione intera
            
             
** Macchina di Antikythera
            - È il più antico calcolatore meccanico conosciuto, databile intorno al 100 - 150 A.C
            - Si tratta di un sofisticato planetario, mosso da ruote dentate, che serviva per calcolare il sorgere del sole, le fasi lunari,
              i movimenti dei 5 pianeti allora conosciuti, gli equinozi, i mesi e i giorni della settimana.
            - Trae il nome dall'isola greca Anticitera ( Cerigotto ) presso cui è stata rinvenuta.
            
            
** Pascalina 1640
            - Blaise Pascal progetta e realizza la Pascalina: Calcolatore meccanico per addizioni
                
                
** Leibnitz 1673
            
            Macchina per addizioni, sottrazioni, moltiplicazioni, divisioni e radice quadrata
            
              
** Babbage 1824
            
            Macchina "General-purpose" le cui funzionalità dipendono da come è progettata
            
              
*** Ada Lovelace Byron ( 1815 - 1852 )
                - Figlia del noto poeta inglese
                - Collabora con Babbage
                - Scrive il primo software della storia
                    
                      
** Hollerit 1890
            - Fondatore dell'IBM, inventa l'uso delle carte perforate per automatizzare la tabulazione dei dati di un censimento
            - Il costo della tabulazione risultò essere maggiore del 98% rispetto al censimento precedente,
              dovuto in parte alla tentazione di usare al massimo la macchina e tabulare un maggior numero di dati
            - I risultati del censimento furono ottenuti in tempo molto minore del precedente
                
                 
*** Tra '800 e '900
            - Nel 1890 venne utilizzata una macchina per il conteggio tramite schede perforate che trovò largo uso negli uffici statunitensi per il censimento di quello stesso anno.
            - Questo tipo di macchine si diffusero rapidamente sia negli uffici governativi che in quelli privati
            - Venne fondata una società per la commercializzazione di quelle che venivano chiamate macchine meccanografiche
            - Questa società diventerà nel 1924 la International Business Machine ( IBM )
        - Schede perforate
            - L'ingresso del calcolatore nel mondo del lavoro risale all'inizio del 1900; la tecnologia delle macchine di calcolo era di tipo meccanografico
            - Con queste macchine si eseguivano calcoli ad una discreta velocità ( per quei tempi ), dell'ordine delle 60 operazioni al minuto; la loro gestione tuttavia era molto complessa
                
                 
