docs/arch/introduzione.html
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Sistema Operativo ( SO )</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Per ora pensiamo al S.O come un livello il cui linguaggio è l&rsquo;ISA estesa con nuove istruzioni ad alto livello per gestire risorse critiche
<ul class="org-ul">
<li>Offre nuove istruzioni oltre a quella base dell&rsquo;ISA
</li>
</ul>
<ul class="org-ul">
<li>Livello Hardware/Firmware
<ul class="org-ul">
<li>Livello della logica digitale ( HW )
<ul class="org-ul">
<li>Fili e porte logiche ( Gate ) realizzati tramite transistor ( speciali interruttori )
</li>
<li>Gate ( fili ) elaborano ( trasportano ) segnali binari ( 0 / 1 )
</li>
<li>Tramite questi segnali è possibile rappresentare qualsiasi tipo di informazione
</li>
<li>Interconnettendo gate e fili è possibile realizzare funzioni complesse
</li>
<li>È anche possibile realizzare elementi di memoria ( utilizzati per dati e programmi )
</li>
</ul>
</li>
<li>Livello della microarchitettura ( FW )
<ul class="org-ul">
<li>Costruito sopra il livello della logica digitale, si occupa di interpretare ed eseguire le istruzioni del livello ISA
</li>
<li>È il livello di macchina nuda che appare al programmatore di sistema
</li>
<li>comprende un insieme di istruzioni che di solito sono diverse per ogni processore
<ul class="org-ul">
<li>Problema della portabilità binaria
</li>
</ul>
</li>
<li>La sintassi è adatta ad essere interpretata facilmente dal livello sottostante
</li>
</ul>
</li>
</ul>
</li>
<li>Livello Linguaggio Macchina ( ISA )

<p>
Le istruzioni sono stringhe di Bit con formato ben determinato per permettere la facile individuazione di codice e operandi delle istruzioni 
</p>

<ul class="org-ul">
<li>I codici individuano l&rsquo;operazione elementare che l’istruzione dovrà eseguire
</li>
<li>Gli operandi si riferiscono alle locazioni di memoria che contengono i dati su cui eseguire l&rsquo;operazione e le locazioni dove memorizzare i risultati
</li>
</ul>
</li>
<li>Livello Linguaggio Assembler
<ul class="org-ul">
<li>Offre al programmatore di sistema una vista più &ldquo;umana&rdquo; del livello macchina
<ul class="org-ul">
<li>Istruzioni espresse con stringhe di carattere mnemoniche invece di stringhe binarie
</li>
<li>Traduzione realizzata dall’assemblatore ( è una speciale compilatore ) rispetto al livello macchina
</li>
</ul>
</li>
<li>L&rsquo;assemblatore è uno dei primi software di sistema realizzato per facilitare la programmazione dei calcolatori
</li>
</ul>
</li>
<li>Livello Linguaggio ad alto livello
<ul class="org-ul">
<li>C, C++, Modula 3, Java, &#x2026;
</li>
<li>Permette al programmatore una maggiore astrazione rispetto ai livelli sottostanti della macchina
</li>
<li>Ha di solito bisogno di un traduttore ( compilatore )
</li>
<li>Per alcuni linguaggi esistono interpreti: per esempio Java
</li>
<li>È il livello solitamente usato per produrre software
</li>
<li>Tale livello permette di realizzare la portabilità tra processori con diversa ISA
<ul class="org-ul">
<li>Basta che esista il compilatore/interprete implementato per la nuova ISA
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Software applicativo e di sistema</h2>
<div class="outline-text-2" id="text-5">
<p>
Compilatori, assemblatori, OS, Word processor, ecc&#x2026; è tutto software
</p>
<ul class="org-ul">
<li>Il software di sistema serve a
<ul class="org-ul">
<li>Produrre altro software ( sia di sistema che applicativo )
</li>
<li>Permettere l&rsquo;esecuzione di altro software
</li>
</ul>
</li>
<li>Il software applicativo
<ul class="org-ul">
<li>Costruisce la maggior parte del software
</li>
<li>Lo scopo di questo software dipende dallo specifico campo applicativo
<ul class="org-ul">
<li>Applicazioni bancarie
</li>
<li>CAD
</li>
<li>Word processor
</li>
<li>Foglio elettronico
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Storia</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Abaco Cinese</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>L&rsquo;abaco cinese può essere considerato il primo modello matematico di calcolo
</li>
<li>In questo modello si possono formalizzare le quattro operazioni
<ul class="org-ul">
<li>Somma
</li>
<li>Sottrazione
</li>
<li>Prodotto
</li>
<li>Divisione intera
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Macchina di Antikythera</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>È il più antico calcolatore meccanico conosciuto, databile intorno al 100 - 150 A.C
</li>
<li>Si tratta di un sofisticato planetario, mosso da ruote dentate, che serviva per calcolare il sorgere del sole, le fasi lunari,
i movimenti dei 5 pianeti allora conosciuti, gli equinozi, i mesi e i giorni della settimana.
</li>
<li>Trae il nome dall&rsquo;isola greca Anticitera ( Cerigotto ) presso cui è stata rinvenuta.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Pascalina 1640</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>Blaise Pascal progetta e realizza la Pascalina: Calcolatore meccanico per addizioni
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Leibnitz 1673</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Macchina per addizioni, sottrazioni, moltiplicazioni, divisioni e radice quadrata
</p>
</div>
</div>


<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Babbage 1824</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Macchina &ldquo;General-purpose&rdquo; le cui funzionalità dipendono da come è progettata
</p>
</div>


<div id="outline-container-sec-6-5-1" class="outline-4">
<h4 id="sec-6-5-1"><span class="section-number-4">6.5.1</span> Ada Lovelace Byron ( 1815 - 1852 )</h4>
<div class="outline-text-4" id="text-6-5-1">
<ul class="org-ul">
<li>Figlia del noto poeta inglese
</li>
<li>Collabora con Babbage
</li>
<li>Scrive il primo software della storia
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Hollerit 1890</h3>
<div class="outline-text-3" id="text-6-6">
<ul class="org-ul">
<li>Fondatore dell&rsquo;IBM, inventa l&rsquo;uso delle carte perforate per automatizzare la tabulazione dei dati di un censimento
</li>
<li>Il costo della tabulazione risultò essere maggiore del 98% rispetto al censimento precedente,
dovuto in parte alla tentazione di usare al massimo la macchina e tabulare un maggior numero di dati
</li>
<li>I risultati del censimento furono ottenuti in tempo molto minore del precedente
</li>
</ul>
</div>


<div id="outline-container-sec-6-6-1" class="outline-4">
<h4 id="sec-6-6-1"><span class="section-number-4">6.6.1</span> Tra &rsquo;800 e &rsquo;900</h4>
<div class="outline-text-4" id="text-6-6-1">
<ul class="org-ul">
<li>Nel 1890 venne utilizzata una macchina per il conteggio tramite schede perforate che trovò largo uso negli uffici statunitensi per il censimento di quello stesso anno.
</li>
<li>Questo tipo di macchine si diffusero rapidamente sia negli uffici governativi che in quelli privati
</li>
<li>Venne fondata una società per la commercializzazione di quelle che venivano chiamate macchine meccanografiche
</li>
<li>Questa società diventerà nel 1924 la International Business Machine ( IBM )
</li>
</ul>
<ul class="org-ul">
<li>Schede perforate
<ul class="org-ul">
<li>L&rsquo;ingresso del calcolatore nel mondo del lavoro risale all&rsquo;inizio del 1900; la tecnologia delle macchine di calcolo era di tipo meccanografico
</li>
<li>Con queste macchine si eseguivano calcoli ad una discreta velocità ( per quei tempi ), dell&rsquo;ordine delle 60 operazioni al minuto; la loro gestione tuttavia era molto complessa
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
