arch/introduzione.org
** ENIAC 1946
            - Electronic Numerical Integrator and Calculator
            - Considerato il primo calcolatore a valvole general-purpose programmabile
            - Creata da Mauchly & Eckert (Univ. Pennsylvania)
            - 18000 valvole - 30 tons
            - 140 KW - 24x3x2 metri
            - Programmazione tramite inserimento di cavi e azionamento di interruttori
            - Dati inseriti con schede perforate
                - Per programmare ENIAC era necessario modificare la disposizione di un grande numero di fili collegati a uno dei suoi pannelli.
                - Programmare ENIAC era una questione non solo di algoritmi ma anche di saldature e collegamenti elettrici, rendendo l’operazione molto difficoltosa
        - Enigma
            
            In Germania, durante la seconda guerra mondiale, venne utilizzata Enigma, una macchina crittografica per cifrare le comunicazioni, inventata da un polacco e finita misteriosamente in mani naziste
            
            
            - 1943: In Inghilterra COLOSSUS, progettato da Alan Turing, ha un ruolo importante per decifrare i codici segreti usati dall'armata tedesca nella seconda guerra mondiale
                
                  
** John Von Neumann
            - Inventò il concetto di Stored-program computer
                - Constatò che era noioso riprogrammare l'ENIAC
                - Poiché anche i programmi sono rappresentabili in binario, esattamente come i dati, propose di porre programmi e dati assieme in memoria
                - ISA: Store-program computer costruito da Von Neumann a Princeton
                - In pratica il calcolatore diventa un elaboratore capace di trattare qualsiasi informazione in codice binario
                    
                       
** Mauchly & Eckert
            - Nel 1946 progettano e costruiscono l'EDVAC ( dell' Electronic Discrete Variable Automatic Computer ), basato sull'architettura di Von Neumann
            - Crearono una ditta diventata poi l'Unisys
            - Cercarono di ottenere il brevetto per l'invenzione del calcolatore elettronico, ma persero la causa.
            - Il brevetto fu invece attribuito ad Atanasoff, che aveva costruito una macchina special-purpose ( ABC ) agli inizi degli '40
        - Sviluppo commerciale
            - Per arrivare al primo successo commericale
                - Univac 1 ( 1951 ) - Universal Automatic Computer
                    - Prodotto dalla ditta fondata da Mauchly & Eckert
                    - Prodotto in 48 esemplari, venduto a 1M $
            - IBM entrò nel mercato successivamente
                - IBM 701 ( 1952 )
            - Gli anni 50 videro l'avvento dei transistor
                - Transistor inventati nel 1948 da Bardeen, Brattain, Shockley
                - Primo computer costruito al M.I.T. di boston alla fine degli anni '50
                - Agli inizi degli anni '60, l'IBM costruì il 7090 ( basato su transistor invece che su valvole come il 709 )
                - La DEC, una ditta fondata da Olsen, un ricercatore del M.I.T. , nel 1961 commercializzò il PDP-1 basato su transistor
            - IBM S/360 ( 1964 )
                - Famiglia di computer
                - Variabili in prezzo e prestazioni
                - Stessa architettura astratta
                - Capacità di simulare ISA di altri modelli IBM precedenti
            - DEC PDP-8 ( 1965 )
                - Il primo minicomputer
                - Venduti circa 50000 esemplari
                - Costo contenuto ( solo 16000$ )
            - Avvento circuiti integrati e VLSI
                - Invenzione dei circuiti integrati su silicio dovuto a Noyce nel 1958
                - Negli anni '70, famiglia IBM S/360 e DEC PDP-11, costruiti con circuiti integrati
                - Negli anni '80, VLSI ( Very Large Scale Integration ) ha permesso di mettere sullo stesso chip
                    - 10.000, 100.000, e finalmente diversi milioni di transistor
            - Negli anni '80
                - I prezzi si abbassano
                - Microprocessori ( CPU su singolo chip )
                - Avvento dei Personal Computer
                    - Apple, Apple ][ , PC IBM ( 1981 )
            - Metà anni '80
                - Architettura RISC, che prendono il poso delle complicate architetture CISC
        L'algoritmo impiegato nei calcolatori per sottrarre numeri binari
        
        Viene utilizzata una particolare rappresentaziones
        
        
        - Caratteristiche delle rappresentazioni
            - Bilanciamento: Nel complemento a due, nessun numero positivo corrisponde al più piccolo valore negativo
            - Numero di zeri: Le rappresentazioni in Modulo e Segno, e quella in Complemento a Uno, hanno 2 rappresentazioni per lo zero
            - Semplicità delle operazioni: Per il Modulo e segno bisogna prima guardare i segni e confrontare i moduli, per decidere sia il segno del risultato, e sia per decidere se bisogna sommare o sottrarre.
            
            > Il complemento a uno non permette di sommare numeri negativi
            > 
        - Complemento a 2
            
            La rappresentazione in complemento a 2 è quella adottata dai calcolatori per i numeri interi con segno ( signed )
            
            Il Bit più significativo corrisponde al segno ( 0 positivo, 1 negativo )
            
            - Numeri relativi ( signed ) rappresentabili su 32Bit
                
                
            - Numeri relativi ( signed ) rappresentabili su 64Bit:
                

                
            - Rappresentazione
                
                Rappresentazione di numeri in complemento a 2 su n Bit dei numeri signed:
                
                
            - Valore
                
                Il valore corrispondente alla rappresentazione dei numeri positivi è quello solito
                
                - Per quanto riguarda i numeri negativi, per ottenere direttamente il valore di un numero negativo su n posizioni, basta considerare
                    - Il Bit di segno ( = 1 ) in posizione $n-1$ con peso : $-2^{n-1}$
                    - Tutti gli altri bit in posizione $i\$ con peso $2^i$
                      
            - Cambio di segno
                
                Dato un numero positivo $N$, con bit di segno uguale a 0
                
                Per ottenere la rappresentazione in complemento a 2 di $-N$ è possibile impiegare equivalentemente
                
                - Algoritmo 1: Invertire tutti i bit ( ovvero Complemento a uno ) e somma 1
                - Algoritmo 2: Invertire tutti i bit a sinistra della cifra 1 meno significativa

