docs/arch/introduzione.html


<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> ENIAC 1946</h3>
<div class="outline-text-3" id="text-6-7">
<ul class="org-ul">
<li>Electronic Numerical Integrator and Calculator
</li>
<li>Considerato il primo calcolatore a valvole general-purpose programmabile
</li>
<li>Creata da Mauchly &amp; Eckert (Univ. Pennsylvania)
</li>
<li>18000 valvole - 30 tons
</li>
<li>140 KW - 24x3x2 metri
</li>
<li>Programmazione tramite inserimento di cavi e azionamento di interruttori
</li>
<li>Dati inseriti con schede perforate
<ul class="org-ul">
<li>Per programmare ENIAC era necessario modificare la disposizione di un grande numero di fili collegati a uno dei suoi pannelli.
</li>
<li>Programmare ENIAC era una questione non solo di algoritmi ma anche di saldature e collegamenti elettrici, rendendo l’operazione molto difficoltosa
</li>
</ul>
</li>
</ul>
<ul class="org-ul">
<li>Enigma

<p>
In Germania, durante la seconda guerra mondiale, venne utilizzata Enigma, una macchina crittografica per cifrare le comunicazioni, inventata da un polacco e finita misteriosamente in mani naziste
</p>
</li>
</ul>


<ul class="org-ul">
<li>1943: In Inghilterra COLOSSUS, progettato da Alan Turing, ha un ruolo importante per decifrare i codici segreti usati dall&rsquo;armata tedesca nella seconda guerra mondiale
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> John Von Neumann</h3>
<div class="outline-text-3" id="text-6-8">
<ul class="org-ul">
<li>Inventò il concetto di Stored-program computer
<ul class="org-ul">
<li>Constatò che era noioso riprogrammare l&rsquo;ENIAC
</li>
<li>Poiché anche i programmi sono rappresentabili in binario, esattamente come i dati, propose di porre programmi e dati assieme in memoria
</li>
<li>ISA: Store-program computer costruito da Von Neumann a Princeton
</li>
<li>In pratica il calcolatore diventa un elaboratore capace di trattare qualsiasi informazione in codice binario
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> Mauchly &amp; Eckert</h3>
<div class="outline-text-3" id="text-6-9">
<ul class="org-ul">
<li>Nel 1946 progettano e costruiscono l&rsquo;EDVAC ( dell&rsquo; Electronic Discrete Variable Automatic Computer ), basato sull&rsquo;architettura di Von Neumann
</li>
<li>Crearono una ditta diventata poi l&rsquo;Unisys
</li>
<li>Cercarono di ottenere il brevetto per l&rsquo;invenzione del calcolatore elettronico, ma persero la causa.
</li>
<li>Il brevetto fu invece attribuito ad Atanasoff, che aveva costruito una macchina special-purpose ( ABC ) agli inizi degli &rsquo;40
</li>
</ul>
<ul class="org-ul">
<li>Sviluppo commerciale
<ul class="org-ul">
<li>Per arrivare al primo successo commericale
<ul class="org-ul">
<li>Univac 1 ( 1951 ) - Universal Automatic Computer
<ul class="org-ul">
<li>Prodotto dalla ditta fondata da Mauchly &amp; Eckert
</li>
<li>Prodotto in 48 esemplari, venduto a 1M $
</li>
</ul>
</li>
</ul>
</li>
<li>IBM entrò nel mercato successivamente
<ul class="org-ul">
<li>IBM 701 ( 1952 )
</li>
</ul>
</li>
<li>Gli anni 50 videro l&rsquo;avvento dei transistor
<ul class="org-ul">
<li>Transistor inventati nel 1948 da Bardeen, Brattain, Shockley
</li>
<li>Primo computer costruito al M.I.T. di boston alla fine degli anni &rsquo;50
</li>
<li>Agli inizi degli anni &rsquo;60, l&rsquo;IBM costruì il 7090 ( basato su transistor invece che su valvole come il 709 )
</li>
<li>La DEC, una ditta fondata da Olsen, un ricercatore del M.I.T. , nel 1961 commercializzò il PDP-1 basato su transistor
</li>
</ul>
</li>
<li>IBM S/360 ( 1964 )
<ul class="org-ul">
<li>Famiglia di computer
</li>
<li>Variabili in prezzo e prestazioni
</li>
<li>Stessa architettura astratta
</li>
<li>Capacità di simulare ISA di altri modelli IBM precedenti
</li>
</ul>
</li>
<li>DEC PDP-8 ( 1965 )
<ul class="org-ul">
<li>Il primo minicomputer
</li>
<li>Venduti circa 50000 esemplari
</li>
<li>Costo contenuto ( solo 16000$ )
</li>
</ul>
</li>
<li>Avvento circuiti integrati e VLSI
<ul class="org-ul">
<li>Invenzione dei circuiti integrati su silicio dovuto a Noyce nel 1958
</li>
<li>Negli anni &rsquo;70, famiglia IBM S/360 e DEC PDP-11, costruiti con circuiti integrati
</li>
<li>Negli anni &rsquo;80, VLSI ( Very Large Scale Integration ) ha permesso di mettere sullo stesso chip
<ul class="org-ul">
<li>10.000, 100.000, e finalmente diversi milioni di transistor
</li>
</ul>
</li>
</ul>
</li>
<li>Negli anni &rsquo;80
<ul class="org-ul">
<li>I prezzi si abbassano
</li>
<li>Microprocessori ( CPU su singolo chip )
</li>
<li>Avvento dei Personal Computer
<ul class="org-ul">
<li>Apple, Apple ][ , PC IBM ( 1981 )
</li>
</ul>
</li>
</ul>
</li>
<li>Metà anni &rsquo;80
<ul class="org-ul">
<li>Architettura RISC, che prendono il poso delle complicate architetture CISC
</li>
</ul>
</li>
</ul>
</li>
</ul>
<p>
L&rsquo;algoritmo impiegato nei calcolatori per sottrarre numeri binari
</p>

<p>
Viene utilizzata una particolare rappresentaziones
</p>


<ul class="org-ul">
<li>Caratteristiche delle rappresentazioni
<ul class="org-ul">
<li>Bilanciamento: Nel complemento a due, nessun numero positivo corrisponde al più piccolo valore negativo
</li>
<li>Numero di zeri: Le rappresentazioni in Modulo e Segno, e quella in Complemento a Uno, hanno 2 rappresentazioni per lo zero
</li>
<li>Semplicità delle operazioni: Per il Modulo e segno bisogna prima guardare i segni e confrontare i moduli, per decidere sia il segno del risultato, e sia per decidere se bisogna sommare o sottrarre.
</li>
</ul>

<p>
&gt; Il complemento a uno non permette di sommare numeri negativi
&gt; 
</p>
</li>
<li>Complemento a 2

<p>
La rappresentazione in complemento a 2 è quella adottata dai calcolatori per i numeri interi con segno ( signed )
</p>

<p>
Il Bit più significativo corrisponde al segno ( 0 positivo, 1 negativo )
</p>

<ul class="org-ul">
<li>Numeri relativi ( signed ) rappresentabili su 32Bit
</li>
</ul>
</li>
</ul>


<ul class="org-ul">
<li>Numeri relativi ( signed ) rappresentabili su 64Bit:
</li>
</ul>



<ul class="org-ul">
<li>Rappresentazione

<p>
Rappresentazione di numeri in complemento a 2 su n Bit dei numeri signed:
</p>
</li>
</ul>


<ul class="org-ul">
<li>Valore

<p>
Il valore corrispondente alla rappresentazione dei numeri positivi è quello solito
</p>

<ul class="org-ul">
<li>Per quanto riguarda i numeri negativi, per ottenere direttamente il valore di un numero negativo su n posizioni, basta considerare
<ul class="org-ul">
<li>Il Bit di segno ( = 1 ) in posizione \(n-1\) con peso : \(-2^{n-1}\)
</li>
<li>Tutti gli altri bit in posizione \(i\\) con peso \(2^i\)
</li>
</ul>
</li>
</ul>
</li>

<li>Cambio di segno

<p>
Dato un numero positivo \(N\), con bit di segno uguale a 0
</p>

<p>
Per ottenere la rappresentazione in complemento a 2 di \(-N\) è possibile impiegare equivalentemente
</p>

<ul class="org-ul">
<li>Algoritmo 1: Invertire tutti i bit ( ovvero Complemento a uno ) e somma 1
</li>
<li>Algoritmo 2: Invertire tutti i bit a sinistra della cifra 1 meno significativa
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Jacopo Costantini &amp; Matteo Zambon</p>
<p class="date">Created: 2022-01-08 Sat 14:29</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
